// bAUsaq6LI
// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let x = 0
if (x !== 0){
    console.log('true')
} else {
    console.log('false')
}
let a =0


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time =  +prompt('enter')
if (time  >=  0 && time <  15){
    console.log('перша чверть')
} else if ( time >= 15 && time < 30 ){
    console.log('друга чверть ')
} else if (time >=  30 && time<50){
    console.log('третя чверть')
}else if (time >= 50 && time <60){
    console.log('четверта чверть')
}

