// У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = +prompt("Введіть число в яке ви народилися")
if (day >= 1 && day <11){
    console.log('Ви народилися у першу декаду місяця')
} else if ( day >= 11 && day <21 ){
    console.log('Ви народилися у другу декаду місяця')
}else if ( day >= 21 && day <32 ){
    console.log('Ви народилися у третю декаду місяця')
} else if (day >=32 )
    console.log('???????')
